Revit 2026 API

# PointLightShape Properties

---

The PointLightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape) |

#### Reference

PointLightShape Class

Autodesk.Revit.DB.Lighting Namespace